{
  "words": [
    {
      "word": "abstract",
      "meaning": "A Java programming language keyword used in a class definition to specify that a class is not to be instantiated, but rather inherited by other classes. An abstract class can have abstract methods that are not implemented in the abstract class, but in subclasses."
    },
    {
      "word": "applet",
      "meaning": "A program written in the Java programming language to run within a web browser compatible with the Java platform."
    },
    {
      "word": "argument",
      "meaning": "A data item specified in a method call. An argument can be a literal value, a variable, or an expression."
    },
    {
      "word": "array",
      "meaning": "A collection of data items, all of the same type, in which each item's position is uniquely designated by an integer."
    },
    {
      "word": "Binary",
      "meaning": "An operator that has two arguments."
    },
    {
      "word": "Bit",
      "meaning": "The smallest unit of information in a computer, with a value of either 0 or 1."
    },
    {
      "word": "Block",
      "meaning": "In the Java programming language, any code between matching braces."
    },
    {
      "word": "Boolean",
      "meaning": "Refers to an expression or variable that can have only a true or false value."
    },
    {
      "word": "break",
      "meaning": "A Java programming language keyword used to resume program execution at the statement immediately following the current statement."
    },
    {
      "word": "byte",
      "meaning": "A sequence of eight bits."
    },
    {
      "word": "bytecode",
      "meaning": "Machine-independent code generated by the Java compiler and executed by the Java interpreter."
    },
    {
      "word": "case",
      "meaning": "A Java programming language keyword that defines a group of statements to begin executing if a value specified matches the value defined by a preceding \"switch\" keyword."
    },
    {
      "word": "casting",
      "meaning": "Explicit conversion from one data type to another."
    },
    {
      "word": "catch",
      "meaning": "A Java programming language keyword used to declare a block of statements to be executed in the event that a Java exception, or run time error, occurs in a preceding \"try\" block."
    },
    {
      "word": "char",
      "meaning": "A Java programming language keyword used to declare a variable of type character."
    },
    {
      "word": "class",
      "meaning": "In the Java programming language, a type that defines the implementation of a particular kind of object."
    },
    {
      "word": "class method",
      "meaning": "A method that is invoked without reference to a particular object."
    },
    {
      "word": "class variable",
      "meaning": "A data item associated with a particular class as a whole--not with particular instances of the class."
    },
    {
      "word": "comment",
      "meaning": "In a program, explanatory text that is ignored by the compiler."
    },
    {
      "word": "compiler",
      "meaning": "A program to translate source code into code to be executed by a computer."
    },
    {
      "word": "compositing",
      "meaning": "The process of superimposing one image on another to create a single image."
    },
    {
      "word": "constructor",
      "meaning": "A pseudo-method that creates an object."
    },
    {
      "word": "default",
      "meaning": "A Java programming language keyword optionally used after all \"case\" conditions in a \"switch\" statement."
    },
    {
      "word": "do",
      "meaning": "A Java programming language keyword used to declare a loop that will iterate a block of statements."
    },
    {
      "word": "double",
      "meaning": "A Java programming language keyword used to define a variable of type double."
    },
    {
      "word": "else",
      "meaning": "A Java programming language keyword used to execute a block of statements in the case that the test condition with the \"if\" keyword evaluates to false."
    },
    {
      "word": "encapsulation",
      "meaning": "The localization of knowledge within a module."
    },
    {
      "word": "exception",
      "meaning": "An event during program execution that prevents the program from continuing normally; generally, an error."
    },
    {
      "word": "exception handler",
      "meaning": "A block of code that reacts to a specific type of exception."
    },
    {
      "word": "executable content",
      "meaning": "An application that runs from within an HTML file."
    },
    {
      "word": "extends",
      "meaning": "Class X extends class Y to add functionality."
    },
    {
      "word": "field",
      "meaning": "A data member of a class."
    },
    {
      "word": "final",
      "meaning": "A Java programming language keyword. You define an entity once and cannot change it."
    },
    {
      "word": "finally",
      "meaning": "A Java programming language keyword that executes a block of statements regardless of whether a Java Exception, or run time error, occurred in a block defined previously by the \"try\" keyword."
    },
    {
      "word": "float",
      "meaning": "A Java programming language keyword used to define a floating-point number variable."
    },
    {
      "word": "for",
      "meaning": "A Java programming language keyword used to declare a loop that reiterates statements."
    },
    {
      "word": "GUI",
      "meaning": "Graphical User Interface."
    },
    {
      "word": "hexadecimal",
      "meaning": "The numbering system that uses 16 as its base."
    },
    {
      "word": "identifier",
      "meaning": "The name of an item in a program."
    },
    {
      "word": "if",
      "meaning": "A Java programming language keyword used to conduct a conditional test."
    },
    {
      "word": "implements",
      "meaning": "A Java programming language keyword optionally included in the class declaration to specify any interfaces that are implemented by the current class."
    },
    {
      "word": "import",
      "meaning": "A Java programming language keyword used at the beginning of a source file."
    },
    {
      "word": "inheritance",
      "meaning": "The concept of classes automatically containing the variables and methods defined in their supertypes."
    },
    {
      "word": "instance",
      "meaning": "An object of a particular class."
    },
    {
      "word": "int",
      "meaning": "A Java programming language keyword used to define a variable of type integer."
    },
    {
      "word": "Java",
      "meaning": "Sun's trademark for a set of technologies for creating and safely running software programs."
    },
    {
      "word": "literal",
      "meaning": "The basic representation of any integer, floating point, or character value."
    },
    {
      "word": "long",
      "meaning": "A Java programming language keyword used to define a variable of type long."
    },
    {
      "word": "method",
      "meaning": "A function defined in a class."
    },
    {
      "word": "multithreaded",
      "meaning": "Describes a program that is designed to have parts of its code execute concurrently."
    },
    {
      "word": "null",
      "meaning": "A Java programming language keyword used to specify an undefined value for reference variables."
    },
    {
      "word": "object",
      "meaning": "The principal building blocks of object-oriented programs."
    },
    {
      "word": "octal",
      "meaning": "The numbering system using 8 as its base."
    },
    {
      "word": "overloading",
      "meaning": "Using one identifier to refer to multiple items in the same scope."
    },
    {
      "word": "overriding",
      "meaning": "Providing a different implementation of a method in a subclass of the class that originally defined the method."
    },
    {
      "word": "package",
      "meaning": "A group of types."
    },
    {
      "word": "peer",
      "meaning": "In networking, any functional unit in the same layer as another entity."
    },
    {
      "word": "private",
      "meaning": "A Java programming language keyword used in a method or variable declaration."
    },
    {
      "word": "process",
      "meaning": "A virtual address space containing one or more threads."
    },
    {
      "word": "protected",
      "meaning": "A Java programming language keyword used in a method or variable declaration."
    },
    {
      "word": "public",
      "meaning": "A Java programming language keyword used in a method or variable declaration."
    },
    {
      "word": "return",
      "meaning": "A Java programming language keyword used to finish the execution of a method."
    },
    {
      "word": "servlet",
      "meaning": "A server-side program that gives Java technology-enabled servers additional functionality."
    },
    {
      "word": "static",
      "meaning": "A Java programming language keyword used to define a variable as a class variable."
    },
    {
      "word": "subarray",
      "meaning": "An array that is inside another array."
    },
    {
      "word": "subclass",
      "meaning": "A class that is derived from a particular class."
    },
    {
      "word": "superclass",
      "meaning": "A class from which a particular class is derived."
    },
    {
      "word": "super",
      "meaning": "A Java programming language keyword used to access members of a class inherited by the class in which it appears."
    },
    {
      "word": "supertype",
      "meaning": "The supertypes of a type are all the interfaces and classes that are extended or implemented by that type."
    },
    {
      "word": "switch",
      "meaning": "A Java programming language keyword used to evaluate a variable."
    },
    {
      "word": "synchronized",
      "meaning": "A keyword in the Java programming language that, when applied to a method or code block."
    },
    {
      "word": "this",
      "meaning": "A Java programming language keyword that can be used to represent an instance of the class in which it appears."
    },
    {
      "word": "thread",
      "meaning": "The basic unit of program execution."
    },
    {
      "word": "throw",
      "meaning": "Keyword that allows the user to throw an exception."
    },
    {
      "word": "throws",
      "meaning": "Used in method declarations."
    },
    {
      "word": "try",
      "meaning": "Defines a block of statements."
    },
    {
      "word": "type",
      "meaning": "A class or interface."
    },
    {
      "word": "variable",
      "meaning": "An item of data named by an identifier."
    },
    {
      "word": "void",
      "meaning": "Used in method declarations."
    },
    {
      "word": "volatile",
      "meaning": "Used in variable declarations."
    },
    {
      "word": "while",
      "meaning": "Used to declare a loop."
    }
  ]
}
